# Add Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontTable..::..Add Method
ExportFontTable Class See Also
---
Inserts a (key,info) pair into Export font table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void Add(
	ExportFontKey exportFontKey,
	ExportFontInfo exportFontInfo
)
```

Visual Basic
---
```text
Public Sub Add ( _
	exportFontKey As ExportFontKey, _
	exportFontInfo As ExportFontInfo _
)
```

Visual C++
---
```text
public:
void Add(
	ExportFontKey^ exportFontKey,
	ExportFontInfo^ exportFontInfo
)
```

# ### Parameters
exportFontKey
    Type: Autodesk.Revit.DB..::..ExportFontKey The export font key to be added.
exportFontInfo
    Type: Autodesk.Revit.DB..::..ExportFontInfo The export font info to be added.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The key already exists in the table. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportFontTable Class
Autodesk.Revit.DB Namespace